[Killed] ArithmeticOperator
mutate/src/getMutationCandidates/getMutationCandidates.js:22:16
   logger.info('MUTATION OPTIONS:\n', payload)
 
   const size = parseInt(MUTATE_MAX)
-  const page = parseInt(MUTATE_SKIP) + 1
+  const page = parseInt(MUTATE_SKIP) - 1
   const search = MUTATE_SEARCH
   const strategy = MUTATE_STRATEGY

[Killed] ArrowFunction
mutate/src/getMutationCandidates/getMutationCandidates.js:37:10
   const mutationCandidates = initialFiles
     .filter(withMatch(match))
     .filter(withSearch(search))
-    .map(x => toMutation(x))
+    .map(() => undefined)
     .filter(Boolean)
 

[Killed] ArithmeticOperator
mutate/src/getMutationCandidates/getMutationCandidates.js:40:31
     .map(x => toMutation(x))
     .filter(Boolean)
 
-  const pageCount = Math.ceil(mutationCandidates.length / size)
+  const pageCount = Math.ceil(mutationCandidates.length * size)
   const pagedList = toPagedList({ size, page })(mutationCandidates)
 

[Killed] BlockStatement
mutate/src/getMutationCandidates/getMutationCandidates.js:44:23
   const pagedList = toPagedList({ size, page })(mutationCandidates)
 
   const [mutate, files] = pagedList.reduce(
-    (result, file) => {
-      const [mutate, files] = result
-
-      const [key] = Object.keys(file)
-
-      const value = file[key]
-
-      if (!value || !value.length) {
-        return result
-      }
-
-      return [
-        [...mutate, key],
-        [...files, key, ...value],
-      ]
-    },
+    (result, file) => {},
     [[], []],
   )

[Killed] BooleanLiteral
mutate/src/getMutationCandidates/getMutationCandidates.js:51:21
 
       const value = file[key]
 
-      if (!value || !value.length) {
+      if (!value || value.length) {
         return result
       }

[Killed] LogicalOperator
mutate/src/getMutationCandidates/getMutationCandidates.js:51:11
 
       const value = file[key]
 
-      if (!value || !value.length) {
+      if (!value && !value.length) {
         return result
       }

[Killed] ArrayDeclaration
mutate/src/getMutationCandidates/getMutationCandidates.js:56:9
       }
 
       return [
-        [...mutate, key],
+        [],
         [...files, key, ...value],
       ]

[Killed] ArrayDeclaration
mutate/src/getMutationCandidates/getMutationCandidates.js:57:9
 
       return [
         [...mutate, key],
-        [...files, key, ...value],
+        [],
       ]
     },

[Killed] ObjectLiteral
mutate/src/getMutationCandidates/getMutationCandidates.js:63:10
     [[], []],
   )
 
-  return {
-    page,
-    size,
-    pageCount,
-    search,
-    mutate,
-    files,
-  }
+  return {}
 }
 
