[Killed] ConditionalExpression
mutate/src/mutate/mutate.js:18:10
       MUTATE_FILE_PATH,
       INIT_CWD,
     },
-    x => x == null,
+    x => true,
   )
 

[Killed] EqualityOperator
mutate/src/mutate/mutate.js:18:10
       MUTATE_FILE_PATH,
       INIT_CWD,
     },
-    x => x == null,
+    x => x != null,
   )
 

[Killed] ConditionalExpression
mutate/src/mutate/mutate.js:21:7
     x => x == null,
   )
 
-  if (nil) {
+  if (true) {
     logger.error('REQUIRED:', nil)
     return

[Killed] BlockStatement
mutate/src/mutate/mutate.js:21:12
     x => x == null,
   )
 
-  if (nil) {
-    logger.error('REQUIRED:', nil)
-    return
-  }
+  if (nil) {}
 
   const filePath = [MUTATE_FILE_PATH]

[Killed] ArrowFunction
mutate/src/mutate/mutate.js:27:10
   }
 
   const filePath = [MUTATE_FILE_PATH]
-    .map(file => path.join(INIT_CWD, file))
+    .map(() => undefined)
     .find(path => fs.existsSync(path))
 

[Killed] ArrowFunction
mutate/src/mutate/mutate.js:28:11
 
   const filePath = [MUTATE_FILE_PATH]
     .map(file => path.join(INIT_CWD, file))
-    .find(path => fs.existsSync(path))
+    .find(() => undefined)
 
   if (!filePath) {

[Killed] BooleanLiteral
mutate/src/mutate/mutate.js:30:7
     .map(file => path.join(INIT_CWD, file))
     .find(path => fs.existsSync(path))
 
-  if (!filePath) {
+  if (filePath) {
     logger.info('NO REPORT FILE FOUND IN DIRECTORY:', { MUTATE_FILE_PATH })
     return

[Killed] ConditionalExpression
mutate/src/mutate/mutate.js:30:7
     .map(file => path.join(INIT_CWD, file))
     .find(path => fs.existsSync(path))
 
-  if (!filePath) {
+  if (true) {
     logger.info('NO REPORT FILE FOUND IN DIRECTORY:', { MUTATE_FILE_PATH })
     return

[Killed] StringLiteral
mutate/src/mutate/mutate.js:35:19
     return
   }
 
-  formData.append('repositoryToken', MUTATE_REPOSITORY_TOKEN)
+  formData.append("", MUTATE_REPOSITORY_TOKEN)
   formData.append('pullNumber', MUTATE_PULL_NUMBER)
   formData.append('pullOwner', MUTATE_PULL_OWNER)

[Killed] StringLiteral
mutate/src/mutate/mutate.js:37:19
 
   formData.append('repositoryToken', MUTATE_REPOSITORY_TOKEN)
   formData.append('pullNumber', MUTATE_PULL_NUMBER)
-  formData.append('pullOwner', MUTATE_PULL_OWNER)
+  formData.append("", MUTATE_PULL_OWNER)
   formData.append('escape', INIT_CWD + '/')
   formData.append('file', fs.createReadStream(filePath))

[Killed] ArithmeticOperator
mutate/src/mutate/mutate.js:38:29
   formData.append('repositoryToken', MUTATE_REPOSITORY_TOKEN)
   formData.append('pullNumber', MUTATE_PULL_NUMBER)
   formData.append('pullOwner', MUTATE_PULL_OWNER)
-  formData.append('escape', INIT_CWD + '/')
+  formData.append('escape', INIT_CWD - '/')
   formData.append('file', fs.createReadStream(filePath))
 

[Killed] StringLiteral
mutate/src/mutate/mutate.js:38:19
   formData.append('repositoryToken', MUTATE_REPOSITORY_TOKEN)
   formData.append('pullNumber', MUTATE_PULL_NUMBER)
   formData.append('pullOwner', MUTATE_PULL_OWNER)
-  formData.append('escape', INIT_CWD + '/')
+  formData.append("", INIT_CWD + '/')
   formData.append('file', fs.createReadStream(filePath))
 

[Killed] StringLiteral
mutate/src/mutate/mutate.js:42:13
   formData.append('file', fs.createReadStream(filePath))
 
   const response = await fetch(MUTATE_API_URL, {
-    method: 'POST',
+    method: "",
     headers: {
       ...formData.getHeaders(),

[Killed] ObjectLiteral
mutate/src/mutate/mutate.js:43:14
 
   const response = await fetch(MUTATE_API_URL, {
     method: 'POST',
-    headers: {
-      ...formData.getHeaders(),
-      'Content-Type': 'application/json',
-    },
+    headers: {},
     body: formData,
   })

[Killed] StringLiteral
mutate/src/mutate/mutate.js:45:7
     method: 'POST',
     headers: {
       ...formData.getHeaders(),
-      'Content-Type': 'application/json',
+      "": 'application/json',
     },
     body: formData,
